Sure!
```
resource "aws_lightsail_database" "test" {
  availability_zone        = "eu-central-1a"
  relational_database_name = "test"
  master_database_name     = "testdatabasename"
  master_password          = "testdatabasepassword"
  master_username          = "test"
  blueprint_id             = "mysql_8_0"
  bundle_id                = "micro_ha_2_0"
}
```

```
Terraform will perform the following actions:

  # aws_lightsail_database.test will be created
  + resource "aws_lightsail_database" "test" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + availability_zone            = "eu-central-1a"
      + backup_retention_enabled     = true
      + blueprint_id                 = "mysql_8_0"
      + bundle_id                    = "micro_ha_2_0"
      + ca_certificate_identifier    = (known after apply)
      + cpu_count                    = (known after apply)
      + created_at                   = (known after apply)
      + disk_size                    = (known after apply)
      + engine                       = (known after apply)
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + master_database_name         = "testdatabasename"
      + master_endpoint_address      = (known after apply)
      + master_endpoint_port         = (known after apply)
      + master_password              = (sensitive value)
      + master_username              = "test"
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + publicly_accessible          = false
      + ram_size                     = (known after apply)
      + relational_database_name     = "test"
      + secondary_availability_zone  = (known after apply)
      + skip_final_snapshot          = false
      + support_code                 = (known after apply)
      + tags_all                     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
```
```
aws_lightsail_database.test: Creating...
╷
│ Error: InvalidInputException: Sorry, you cannot request a specific availability zone for a High Availability database
│ {
│   RespMetadata: {
│     StatusCode: 400,
│     RequestID: "37cf65e4-0c23-484b-9401-a1a1e34a9001"
│   },
│   Code_: "InvalidParams",
│   Message_: "Sorry, you cannot request a specific availability zone for a High Availability database"
│ }
│ 
│   with aws_lightsail_database.test,
│   on main.tf line 48, in resource "aws_lightsail_database" "test":
│   48: resource "aws_lightsail_database" "test" {
│ 
╵
```


And if I've commented `availability_zone`
```
╷
│ Error: Missing required argument
│ 
│   on main.tf line 48, in resource "aws_lightsail_database" "test":
│   48: resource "aws_lightsail_database" "test" {
│ 
│ The argument "availability_zone" is required, but no definition was found.
╵
```